In [22]:
!pip install mysql-connector-python
!pip install SQLAlchemy

Requirement already satisfied: mysql-connector-python in /home/sergiomess/anaconda3/lib/python3.8/site-packages (8.0.28)
Requirement already satisfied: protobuf>=3.0.0 in /home/sergiomess/anaconda3/lib/python3.8/site-packages (from mysql-connector-python) (3.20.0)
Requirement already satisfied: SQLAlchemy in /home/sergiomess/anaconda3/lib/python3.8/site-packages (1.3.20)

In [25]:
!pip install PyMySQL

Collecting PyMySQL
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
     |████████████████████████████████| 43 kB 2.9 MB/s eta 0:00:01
Installing collected packages: PyMySQL
Successfully installed PyMySQL-1.0.2

In [23]:
import mysql.connector as conn
from sqlalchemy import create_engine

In [50]:
str_conn='mysql+pymysql://root:admin@localhost:3306'


motor=create_engine(str_conn)


motor.execute('create database proyectofinal;')

In [60]:

crea_db=conn.connect(host='localhost', user='root', passwd='admin')

cursor=crea_db.cursor()

cursor

In [61]:
cursor.execute('show databases;')

for x in cursor:
    print(x)

('apps',)
('apps1',)
('information_schema',)
('mysql',)
('performance_schema',)
('proyecto',)
('proyectofinal',)
('publications',)
('sys',)

In [62]:
#me conecto a mi base de datos en particular

In [63]:
db=conn.connect(host='localhost', user='root', passwd='admin', database='proyecto')

cursor=db.cursor()

In [65]:

for i in range(len(df)):
    
    insert_query='insert into {} ({}) values {};'\
                 .format('zapatos', ','.join(df.columns), tuple(df.iloc[i].values))
    
    
    insert_query=f"insert into zapatos ({','.join(df.columns)}) values {tuple(df.iloc[i].values)};"
    
    
    cursor.execute(insert_query)
    
    
db.commit()

NameError: name 'proyecto' is not defined

# 1.ACTOR

In [25]:
import pandas as pd
df1 = pd.read_csv('Data/actor.csv')
df1.head(2)

   actor_id first_name last_name          last_update
0         1   PENELOPE   GUINESS  2006-02-15 04:34:33
1         2       NICK  WAHLBERG  2006-02-15 04:34:33

# 2.CATEGORY

In [4]:
df2=pd.read_csv('Data/category.csv')
df2
df2["name"]

0          Action
1       Animation
2        Children
3        Classics
4          Comedy
5     Documentary
6           Drama
7          Family
8         Foreign
9           Games
10         Horror
11          Music
12            New
13         Sci-Fi
14         Sports
15         Travel
Name: name, dtype: object

# 3.FILM

In [26]:
df3=pd.read_csv('Data/film.csv')
df3.head(2)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42

In [6]:
df3.info() #hay una columna que es solo de nulos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   film_id               1000 non-null   int64
 1   title                 1000 non-null   object
 2   description           1000 non-null   object
 3   release_year          1000 non-null   int64
 4   language_id           1000 non-null   int64
 5   original_language_id  0 non-null      float64
 6   rental_duration       1000 non-null   int64
 7   rental_rate           1000 non-null   float64
 8   length                1000 non-null   int64
 9   replacement_cost      1000 non-null   float64
 10  rating                1000 non-null   object
 11  special_features      1000 non-null   object
 12  last_update           1000 non-null   object
dtypes: float64(3), int64(5), object(5)
memory usage: 101.7+ KB

In [28]:
df3.filtrado =df3.drop(['original_language_id'], axis=1)

df3.filtrado.head(2)

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42

# 4.INVENTORY

In [9]:
df4=pd.read_csv('Data/inventory.csv')
df4

     inventory_id  film_id  store_id          last_update
0               1        1         1  2006-02-15 05:09:17
1               2        1         1  2006-02-15 05:09:17
2               3        1         1  2006-02-15 05:09:17
3               4        1         1  2006-02-15 05:09:17
4               5        1         2  2006-02-15 05:09:17
..            ...      ...       ...                  ...
995           996      222         2  2006-02-15 05:09:17
996           997      222         2  2006-02-15 05:09:17
997           998      222         2  2006-02-15 05:09:17
998           999      223         2  2006-02-15 05:09:17
999          1000      223         2  2006-02-15 05:09:17

[1000 rows x 4 columns]

# 5.LANGUAGE

In [10]:
df5=pd.read_csv('Data/language.csv')
df5

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19
5            6    German  2006-02-15 05:02:19

# 6.RENTAL

In [11]:
df6=pd.read_csv('Data/rental.csv')
df6

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
995,997,2005-05-31 00:08:25,4243,216,2005-06-02 00:17:25,2,2006-02-15 21:30:53
996,998,2005-05-31 00:16:57,3395,389,2005-06-01 22:41:57,1,2006-02-15 21:30:53
997,999,2005-05-31 00:25:10,4433,413,2005-06-03 06:05:10,2,2006-02-15 21:30:53
998,1000,2005-05-31 00:25:56,1774,332,2005-06-08 19:42:56,2,2006-02-15 21:30:53
999,1001,2005-05-31 00:46:31,1498,64,2005-06-06 06:14:31,2,2006-02-15 21:30:53

# 7.OLDhdd

In [12]:
df7=pd.read_csv('Data/old_HDD.csv')
df7.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [13]:
df1.head(2)

   actor_id first_name last_name          last_update
0         1   PENELOPE   GUINESS  2006-02-15 04:34:33
1         2       NICK  WAHLBERG  2006-02-15 04:34:33

# LIMPIEZA

In [14]:
#Mergeamos la tabla de actores(df1) con old_HDD(df7) para poner id_actor
film_actor = df1.merge(df7, how='right', on=["first_name","last_name"])
film_actor.head()

,actor_id,first_name,last_name,last_update,title,release_year,category_id
0,1,PENELOPE,GUINESS,2006-02-15 04:34:33,ACADEMY DINOSAUR,2006,6
1,1,PENELOPE,GUINESS,2006-02-15 04:34:33,ANACONDA CONFESSIONS,2006,2
2,1,PENELOPE,GUINESS,2006-02-15 04:34:33,ANGELS LIFE,2006,13
3,1,PENELOPE,GUINESS,2006-02-15 04:34:33,BULWORTH COMMANDMENTS,2006,10
4,1,PENELOPE,GUINESS,2006-02-15 04:34:33,CHEAPER CLYDE,2006,14

In [15]:
#Mergeamos film_actor con films (df3)

In [16]:
film_actor = film_actor.merge(df3, how='left', on=["title","release_year"])
film_actor2 = film_actor[["actor_id", "film_id","category_id"]]
film_actor2

     actor_id  film_id  category_id
0           1        1            6
1           1       23            2
2           1       25           13
3           1      106           10
4           1      140           14
..        ...      ...          ...
995        39      168            3
996        39      203           14
997        39      222           11
998        39      290            9
999        39      293           15

[1000 rows x 3 columns]

In [17]:
film_actor2.columns = ['actor_actor_id','film_film_id',"category_category_id"]
film_actor2.columns

Index(['actor_actor_id', 'film_film_id', 'category_category_id'], dtype='object')

In [18]:
cols=film_actor2.columns.tolist()
cols

['actor_actor_id', 'film_film_id', 'category_category_id']

In [19]:
cols=cols[-1:]+cols[:-1]

In [20]:
film_actor2=film_actor2[cols]

film_actor2.columns

Index(['category_category_id', 'actor_actor_id', 'film_film_id'], dtype='object')

In [21]:
film_actor2

     category_category_id  actor_actor_id  film_film_id
0                       6               1             1
1                       2               1            23
2                      13               1            25
3                      10               1           106
4                      14               1           140
..                    ...             ...           ...
995                     3              39           168
996                    14              39           203
997                    11              39           222
998                     9              39           290
999                    15              39           293

[1000 rows x 3 columns]

In [22]:
df =film_actor2.reindex(columns=["film_film_id","actor_actor_id","category_category_id"])
df

     film_film_id  actor_actor_id  category_category_id
0               1               1                     6
1              23               1                     2
2              25               1                    13
3             106               1                    10
4             140               1                    14
..            ...             ...                   ...
995           168              39                     3
996           203              39                    14
997           222              39                    11
998           290              39                     9
999           293              39                    15

[1000 rows x 3 columns]

In [30]:
df4=pd.read_csv('Data/inventory.csv')
df4.head(2)

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17

In [24]:
df.columns

Index(['film_film_id', 'actor_actor_id', 'category_category_id'], dtype='object')